<a href="https://colab.research.google.com/github/itachi0229/EL3/blob/main/Titanic_Dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

KAREN MACALINO

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
import pandas as pd

In [3]:
filename = '/content/titanic.csv'
df = pd.read_csv(filename)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
df.describe().round(2)

       PassengerId  Survived  Pclass     Age   SibSp   Parch    Fare
count       891.00    891.00  891.00  714.00  891.00  891.00  891.00
mean        446.00      0.38    2.31   29.70    0.52    0.38   32.20
std         257.35      0.49    0.84   14.53    1.10    0.81   49.69
min           1.00      0.00    1.00    0.42    0.00    0.00    0.00
25%         223.50      0.00    2.00   20.12    0.00    0.00    7.91
50%         446.00      0.00    3.00   28.00    0.00    0.00   14.45
75%         668.50      1.00    3.00   38.00    1.00    0.00   31.00
max         891.00      1.00    3.00   80.00    8.00    6.00  512.33

In [6]:
df['Survived'].mean()

0.3838383838383838

In [9]:
df.groupby('Sex')['Survived'].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [10]:
df.groupby(['Name', 'Sex'])['Survived'].mean()

Name                                   Sex
Abbing, Mr. Anthony                    male      0.0
Abbott, Mr. Rossmore Edward            male      0.0
Abbott, Mrs. Stanton (Rosa Hunt)       female    1.0
Abelson, Mr. Samuel                    male      0.0
Abelson, Mrs. Samuel (Hannah Wizosky)  female    1.0
                                                ...
de Mulder, Mr. Theodore                male      1.0
de Pelsmaeker, Mr. Alfons              male      0.0
del Carlo, Mr. Sebastiano              male      0.0
van Billiard, Mr. Austin Blyler        male      0.0
van Melkebeke, Mr. Philemon            male      0.0
Name: Survived, Length: 891, dtype: float64

In [15]:
df.groupby(['Survived', 'Age'])['Survived'].mean()

Survived  Age
0         1.0     0.0
          2.0     0.0
          3.0     0.0
          4.0     0.0
          6.0     0.0
                 ...
1         58.0    1.0
          60.0    1.0
          62.0    1.0
          63.0    1.0
          80.0    1.0
Name: Survived, Length: 142, dtype: float64